"Share on Facebook" = "Partager sur Facebook";
"Share on Twitter" = "Partager sur Twitter";
"Share on Email" = "Partager sur Courriel";
"Cancel" = "Annuler";
"Close" = "Fermer";
"All" = "Tous les";
"Submit" = "Envoyer";